{
  "posts": [
    {
      "id": 1,
      "title": "Google",
      "author": "Nedep",
      "text": "Найбільша пошукова система, що належить корпорації Google Inc. Перша за популярністю (79,65 %), обробляє 41 млрд 345 млн запитів в місяць (частка ринку 62,4 %), може знаходити інформацію 195 мовами. Підтримує пошук у документах форматів PDF, RTF, PostScript, Microsoft Word, Microsoft Excel, Microsoft PowerPoint та інших.",
      "link": "https://www.google.com/"
    },
    {
      "id": 2,
      "title": "Youtube",
      "author": "Homda",
      "text": "Популярний відеохостинг, що надає послуги розміщення відеоматеріалів. Заснований 14 лютого 2005 року трьома працівниками PayPal: Чадом Герлі, Стівеном Чені та Джаведом Карімом. Зараз є підрозділом компанії Google. Станом на серпень 2019 року YouTube є другим за відвідуваністю сайтом в Інтернеті (за даними компанії Alexa Internet).",
      "link": "https://www.youtube.com/"
    },
    {
      "id": 3,
      "title": "Rozetka",
      "author": "Bob2102",
      "text": "Український інтернет-магазин та маркетплейс, що з'явився 2005 року. Найбільший онлайн-ритейлер та маркетплейс в Україні. На сайті та в додатку компанії продаються понад 10 млн товарів у більш, ніж 4000 категоріях. Зокрема, електроніка, побутова техніка, одяг, зоотовари, дитячі товари, спортивні товари, товари для саду та городу, косметика, продукти харчування та алкоголь, товари першої необхідності тощо.",
      "link": "https://rozetka.com.ua/"
    }
  ],
  "profile": [
    {
      "id": "b30234fb-d57b-41ae-bdbf-16d0707cbbdb",
      "username": "123",
      "password": "123"
    },
    {
      "id": "590c69e3-10eb-4542-afeb-9b8aa1ff36f4",
      "username": "Bob2102",
      "password": "bobo123"
    },
    {
      "id": "7e85b326-dbe5-49fa-b719-9ca61cc03db2",
      "username": "Busya",
      "password": "bus123"
    },
    {
      "id": "d83ac9e9-635c-4013-a772-72e814b9bcc3",
      "username": "Nedep123",
      "password": "123Nedep"
    },
    {
      "id": "3834faed-3536-47af-b1ee-970d549b5dc9",
      "username": "Test123",
      "password": "test123"
    },
    {
      "id": "07642737-2f31-4098-ad50-42e8722e6c4a",
      "username": "1234",
      "password": "1234"
    }
  ]
}